Revit 2027 API
Document.PrintManager Property
 Retrieve the PrintManager of current project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PrintManager PrintManager { get; }
Public ReadOnly Property PrintManager As PrintManager
	Get
public:
property PrintManager^ PrintManager {
	PrintManager^ get ();
}
member PrintManager : PrintManager with get
Property Value
PrintManager
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace